app/views/requests/edit.html.erb

  <p>Sorry no teacher meets your expectations</p>
  <% @request.destroy %>   <!-- if there is no teacher, we destroy the current request -->
---
DELETE FROM "requests" WHERE "requests"."id" = $1  [["id", 6]]