app/views/requests/show.html.erb

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  Teacher: <br>
  - <%= "#{@request.teacher.first_name} #{@request.teacher.last_name}" %> <br>

SELECT "courses".* FROM "courses" WHERE "courses"."request_id" = $1  [["request_id", 3]]
SELECT COUNT(*) FROM "courses" WHERE "courses"."request_id" = $1  [["request_id", 3]]
---

<% if @request.courses.count > 0 %>