app/views/teachers/index.html.erb

SELECT "skills".* FROM "skills" WHERE "skills"."teacher_id" = $1  [["teacher_id", 1]]
---
      <h4>Skills :</h4>
      <% skills = Skill.where(teacher: teacher) %>