app/controllers/courses_controller.rb

  def create
    @request = Request.find(params[:request_id])
    @course = Course.new(course_params)
    @course.request = @request
    if @course.save
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "courses" ("length", "date", "request_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["length", 3], ["date", "2020-05-21"], ["request_id", 3], ["created_at", "2020-05-21 13:52:14.800579"], ["updated_at", "2020-05-21 13:52:14.800579"]]

  def export_courses_to_json
    data = JSON.parse(File.read('data.json'))
    data["courses"] = []
    Course.all.each_with_object([]) { |course| data["courses"] << { id: course["id"], date: course["date"], length: course["length"], request_id: course.request["id"] } }
---
SELECT "courses".* FROM "courses"
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]