app/controllers/requests_controller.rb

SELECT "fields".* FROM "fields" WHERE "fields"."name" = $1 LIMIT $2  [["name", "history"], ["LIMIT", 1]]
SELECT "fields".* FROM "fields" WHERE "fields"."name" = $1 LIMIT $2  [["name", "english"], ["LIMIT", 1]]
SELECT "levels".* FROM "levels"
---
  def new
    @fields = Field.all.each_with_object([]) { |field, arr| arr << field["name"] }
    @levels = Level.all.each_with_object([]) { |field, arr| arr << "#{field["grade"]}-#{field["cycle"]}" }

SELECT "fields".* FROM "fields" WHERE "fields"."name" = $1 LIMIT $2  [["name", "history"], ["LIMIT", 1]]
SELECT "levels".* FROM "levels" WHERE "levels"."grade" = $1 AND "levels"."cycle" = $2 LIMIT $3  [["grade", "11th"], ["cycle", "high"], ["LIMIT", 1]]
INSERT INTO "requests" ("client_name", "field_id", "level_id", "created_at", "updated_at", "price_per_hour") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["client_name", "mike"], ["field_id", 3], ["level_id", 6], ["created_at", "2020-05-21 16:38:16.699064"], ["updated_at", "2020-05-21 16:38:16.699064"], ["price_per_hour", 9]]
---
  def create
    # we look for the corresponding field
    @field = Field.find_by(name: params["request"]["field"])

    # we look for the corresponding level
    level_elements = params["request"]["level"]
    level_elements = level_elements.split('-')
    @level = Level.find_by(grade: level_elements[0], cycle: level_elements[1])

    # we create the request with the client_name, price_per_hour and corresponding field & level
    @request = Request.new(request_params)
    @request.field = @field
    @request.level = @level

    if @request.save

SELECT "skills".* FROM "skills" WHERE "skills"."field_id" = $1 AND "skills"."level_id" = $2  [["field_id", 3], ["level_id", 6]]
---
  def edit
    @field = @request.field
    @level = @request.level

    # we get all the teachers matching the field and level
    @matching_teachers = Skill.where(field: @field, level: @level).collect { |skill| skill.teacher }

UPDATE "requests" SET "teacher_id" = $1 WHERE "requests"."id" = $2  [["teacher_id", 1], ["id", 4]]
UPDATE "requests" SET "teacher_id" = $1 WHERE "requests"."id" = $2  [["teacher_id", 3], ["id", 13]]
---
  def update
    if params[:commit] == 'Update Request'  # handle when we update some values of the request with the edit form
      @request.update(request_params)
    else                                    # handle when the client choose a teacher from the collection
      @request.update_column(:teacher_id, params[:teacher_id])

DELETE FROM "requests" WHERE "requests"."id" = $1  [["id", 5]]
---
  def destroy
    @request.destroy

SELECT "courses".* FROM "courses" WHERE "courses"."request_id" = $1  [["request_id", 13]]
---
  def compute_courses_price
    @total_price = 0
    @request.courses.each { |course| @total_price += course.length * @request.price_per_hour }

SELECT "requests".* FROM "requests"
---
  def export_requests_to_json
    data = JSON.parse(File.read('data.json'))
    data["requests"] = []
    Request.all.each_with_object([]) do |request|