app/controllers/requests_controller.rb

UPDATE "requests" SET "teacher_id" = $1 WHERE "requests"."id" = $2  [["teacher_id", 4], ["id", 11]]
---
  def update
    @request.update_column(:teacher_id, params[:teacher_id])

SELECT "requests".* FROM "requests"
---
  def export_teachers_to_json
    @data = JSON.parse(File.read('datatest.json'))
    @data["requests"] = []
    Request.all.each_with_object([]) do |request|