app/controllers/teachers_controller.rb

INSERT INTO "fields" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "mathematics"], ["created_at", "2020-05-20 14:06:06.694226"], ["updated_at", "2020-05-20 14:06:06.694226"]]
INSERT INTO "skills" ("field_id", "level_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["field_id", 1], ["level_id", 1], ["teacher_id", 3], ["created_at", "2020-05-20 17:06:52.320894"], ["updated_at", "2020-05-20 17:06:52.320894"]]
INSERT INTO "skills" ("field_id", "level_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["field_id", 2], ["level_id", 4], ["teacher_id", 3], ["created_at", "2020-05-20 17:06:52.335692"], ["updated_at", "2020-05-20 17:06:52.335692"]]
---
  def create
    params["teacher"]["levels_attributes"].keys.each_with_index do |key, index|
      @field = Field.find_by(name: params["teacher"]["fields_attributes"]["#{key}"]["name"])

      level_elements = params["teacher"]["levels_attributes"]["#{key}"]["cycle"]
      level_elements = level_elements.split('-')
      @level = Level.find_by(grade: level_elements[0], cycle: level_elements[1])

      @teacher = Teacher.find_by(first_name: params["teacher"]["first_name"], last_name: params["teacher"]["last_name"])
      if @teacher.nil?
        @teacher = Teacher.new(teacher_params)
        if @teacher.save
          skill = Skill.new(teacher: @teacher, field: @field, level: @level)
          skill.save
        else
          render :new
          break
        end
      else
        skill = Skill.new(teacher: @teacher, field: @field, level: @level)
        skill.save