app/controllers/teachers_controller.rb

SELECT "fields".* FROM "fields"
INSERT INTO "fields" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "mathematics"], ["created_at", "2020-05-20 14:14:09.517211"], ["updated_at", "2020-05-20 14:14:09.517211"]]
SELECT "levels".* FROM "levels"
---
  def new
    @teacher = Teacher.new
    @teacher.fields.build
    @teacher.levels.build
    @fields = Field.all.each_with_object([]) { |field, arr| arr << field["name"] }
    @levels = Level.all.each_with_object([]) { |field, arr| arr << "#{field["grade"]}-#{field["cycle"]}" }

SELECT "fields".* FROM "fields" WHERE "fields"."name" = $1 LIMIT $2  [["name", "mathematics"], ["LIMIT", 1]]
SELECT "levels".* FROM "levels" WHERE "levels"."grade" = $1 AND "levels"."cycle" = $2 LIMIT $3  [["grade", "6th"], ["cycle", "middle"], ["LIMIT", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."first_name" = $1 AND "teachers"."last_name" = $2 LIMIT $3  [["first_name", "JM"], ["last_name", "Bigard"], ["LIMIT", 1]]
INSERT INTO "teachers" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "JM"], ["last_name", "Bigard"], ["created_at", "2020-05-21 16:15:07.455075"], ["updated_at", "2020-05-21 16:15:07.455075"]]
---
  def create
    # we iterate over the levels to create a new skill with each field and level
    params["teacher"]["levels_attributes"].keys.each_with_index do |key, index|
      # we look for the corresponding field
      @field = Field.find_by(name: params["teacher"]["fields_attributes"]["#{key}"]["name"])

      # we look for the corresponding level
      level_elements = params["teacher"]["levels_attributes"]["#{key}"]["cycle"]
      level_elements = level_elements.split('-')
      @level = Level.find_by(grade: level_elements[0], cycle: level_elements[1])

      # the first iteration, we create a teacher, and for the others we look for the one we just created previously
      @teacher = Teacher.find_by(first_name: params["teacher"]["first_name"], last_name: params["teacher"]["last_name"])

      # we take care to have a field and a level before to save a new teacher, to be sure that we don't save a teacher without skill(s)
      if @field && @level
        if @teacher.nil?
          @teacher = Teacher.new(teacher_params)
          if @teacher.save

SELECT "teachers".* FROM "teachers"
---
        break
      end
      # when the last skill is created we redirect to the teachers index
      redirect_to teachers_path if params["teacher"]["levels_attributes"].keys.length == index + 1

SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 12]]
---
  def destroy
    @teacher = Teacher.find(params[:id])
    @teacher.destroy

SELECT "teachers".* FROM "teachers"
INSERT INTO "skills" ("field_id", "level_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["field_id", 3], ["level_id", 3], ["teacher_id", 9], ["created_at", "2020-05-20 18:05:03.743620"], ["updated_at", "2020-05-20 18:05:03.743620"]]
SELECT "skills".* FROM "skills" WHERE "skills"."teacher_id" = $1  [["teacher_id", 1]]
---
  def export_teachers_to_json
    data = JSON.parse(File.read('data.json'))
    data["teachers"] = []
    Teacher.all.each_with_object([]) { |teacher|
      # we create an array of objects for each skill for each teacher
      skills = Skill.where(teacher: teacher).each_with_object([]) { |skill, arr| arr << {

INSERT INTO "skills" ("field_id", "level_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["field_id", 2], ["level_id", 2], ["teacher_id", 13], ["created_at", "2020-05-21 16:37:39.615330"], ["updated_at", "2020-05-21 16:37:39.615330"]]
---
  def create_new_skill
    skill = Skill.new(teacher: @teacher, field: @field, level: @level)
    skill.save